Router 3:

         --- System Configuration Dialog ---

Continue with configuration dialog? [yes/no]: n


Press RETURN to get started!



Router>enable
Router#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface Serial0/1/0
Router(config-if)#ip address 40.0.0.3 255.0.0.0
Router(config-if)#no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface Serial0/1/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/1/0, changed state to up

Router(config-if)#exit
Router(config)#interface Serial0/0/0
Router(config-if)#
Router(config-if)#exit
Router(config)#interface Serial0/1/0
Router(config-if)#
Router(config-if)#exit
Router(config)#interface Serial0/1/1
Router(config-if)#
Router(config-if)#exit
Router(config)#interface Serial0/0/0
Router(config-if)#
Router(config-if)#exit
Router(config)#interface Serial0/0/0
Router(config-if)#
Router(config-if)#exit
Router(config)#interface Serial0/0/0
Router(config-if)#ip address 50.0.0.3 255.0.0.0
Router(config-if)#no shutdown

Router(config-if)#
%LINK-5-CHANGED: Interface Serial0/0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/0/0, changed state to up

Router(config-if)#exit
Router(config)#interface Serial0/0/0
Router(config-if)#
Router(config-if)#exit
Router(config)#interface Serial0/1/0
Router(config-if)#
Router(config-if)#exit
Router(config)#interface Serial0/1/1
Router(config-if)#ip address 60.0.0.2 255.0.0.0
Router(config-if)#no shutdown

%LINK-5-CHANGED: Interface Serial0/1/1, changed state to down
Router(config-if)#
%LINK-5-CHANGED: Interface Serial0/1/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/1/1, changed state to up









Router con0 is now available






Press RETURN to get started.













Router>en
Router#config t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#router ospf 1
Router(config-router)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/1/1, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/0/0, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/1/0, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/1/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/1/0, changed state to up

Router(config-router)#network 40.0.0.2 0.255.255.255 area 1
Router(config-router)#
00:47:00: %OSPF-5-ADJCHG: Process 1, Nbr 40.0.0.2 on Serial0/1/0 from LOADING to FULL, Loading Done

Router(config-router)#network 50.0.0.2 0.255.255.255 area 1
Router(config-router)#do w
00:48:20: %OSPF-5-ADJCHG: Process 1, Nbr 50.0.0.2 on Serial0/0/0 from LOADING to FULL, Loading Done

Building configuration...
[OK]
Router(config-router)#do write
Building configuration...
[OK]
Router(config-router)#exit
Router(config)#router ospf 1
Router(config-router)#network 60.0.0.3 0.255.255.255 area 1
Router(config-router)#do write
Building configuration...
[OK]
Router(config-router)#exit
Router(config)#exit
Router#
%SYS-5-CONFIG_I: Configured from console by console

00:51:07: %OSPF-5-ADJCHG: Process 1, Nbr 60.0.0.3 on Serial0/1/1 from LOADING to FULL, Loading Done









Router con0 is now available






Press RETURN to get started.











